[
    {
      "slug": "what-is-igcse",
      "title": "What is IGCSE?",
      "summary": "Learn why IGCSE matters and how it supports your future.",
      "date": "2025-03-31",
      "content": "The IGCSE is a globally recognized qualification for students aged 14 to 16. It is equivalent to the GCSE in the UK and is offered by boards like Cambridge (CAIE), Edexcel, and Oxford AQA. Students typically take multiple subjects and receive individual grades. Success can lead to certifications like the Cambridge IGCSE Certificate or the International Certificate of Education (ICE)."
    },
    {
      "slug": "igcse-faq",
      "title": "IGCSE FAQ",
      "summary": "Answers to the most common questions about IGCSE.",
      "date": "2025-03-31",
      "content": "IGCSE is ideal for students aged 14 to 16. It's recognized by universities and employers worldwide. Private candidates can sit for exams via approved centers. Subjects include sciences, languages, humanities, and technical fields. Grades run from A* to G, and it leads to further study like A-levels or foundation programs."
    },
    {
      "slug": "how-to-choose-igcse-subjects",
      "title": "How to Choose Your IGCSE Subjects",
      "summary": "Tips for picking subjects that fit your strengths and goals.",
      "date": "2025-03-31",
      "content": "Choose subjects based on what you enjoy, your future career or academic plans, and your strengths. Consider taking balanced subjects from different groups (Languages, Humanities, Sciences, etc.). Keep workload manageable and ask teachers or mentors for advice."
    },
    {
      "slug": "study-tips-for-igcse-students",
      "title": "Study Tips for IGCSE Students",
      "summary": "Smart study habits can boost your confidence and grades.",
      "date": "2025-03-31",
      "content": "Create a realistic study schedule, set goals, and use past papers to revise. Don’t just memorize — understand the material. Use flashcards, stay healthy, and track progress with tools like IGCSEHub."
    },
    {
      "slug": "advice-for-parents-igcse-learners",
      "title": "Advice for Parents of IGCSE Learners",
      "summary": "How to support your child during IGCSE studies.",
      "date": "2025-03-31",
      "content": "Understand the IGCSE system, encourage a structured study environment, and avoid pressure. Stay involved in a helpful way, promote healthy habits, and use tools that help your child feel supported and confident."
    }
  ]
  